#!coding: utf-8
"""
本文件存放主服务配置文件
`# ！`为系统核心项
"""

# ----------------------------心跳服务--------------------------- #
# !主服务心跳通信端口
HEARTBEAT_PORT_VAR = 10000
# !心跳超时时间(s)
HEARTBEAT_TIMEOUT_VAR = 2

# ---------------------------主从通信服务-------------------------#
# !主从服务通信端口
SLAVE_SERVICE_PORT_VAR = 11000
# !主服务监听IP
SERVICE_HOST_VAR = '0.0.0.0'

# ----------------------------镜像下载--------------------------- #
# (私有镜像仓库所在ip, 私有镜像仓库监听端口, 私有镜像所在服务器端口)
IMAGE_SERVER_LIST = [
    # ('10.42.0.101', 16000, 14000),
    ('127.0.0.1', 16000, 14000)
]

# -----------------------主服务的Web响应服务----------------------- #
# 主服务web后台监听ip
WEB_RESPONSE_HOST = '0.0.0.0'
# 主服务web后台监听端口
WEB_RESPONSE_PORT = 5000
