# coding=utf-8

# ----------------------------系统配置---------------------------- #
# !本机IP
THE_MACHINE_IP = '0.0.0.0'

# ---------------------------主服务镜像服务--------------------------#
# ！主服务与镜像服务通信端口
IMAGE_SERVICE_PORT_VAR = 14000

# ----------------------------心跳服务--------------------------- #
# !主服务心跳通信端口
HEARTBEAT_PORT_VAR = 10000
# !主服务所在IP
SERVICE_HOST_VAR = '10.42.0.10'

# --------------------------harbor镜像仓库配置--------------------- #
HARBOR_URL = 'http://10.42.0.10:17000'
HARBOR_USERNAME = None
HARBOR_PASSWORD = None
